package basicSyntax;

public class ProgrammeArguments {
    public static void main(String[] args) {
        /*
         * Аргументи на командният ред са значенията, които се предават на програмата, при нейното стартиране.
         * При стартирането на конзолна програма, аргументите на командният ред се указват чрез интервал след името на програмата.
         * В IntelliJ IDEA има възможност да подам аргументите на програмния ред, по следният начин:
         * избирам менюто Run > от него избирам опцията Edit Configuration > в отвореният прозорез отивам в
         * полето Program arguments > където ги въвеждам с интервал помежду им.
         */

        for (int a = 0; a < args.length; a++) {
            System.out.printf("[%d] %s%n", a, args[a]);
        }
    }
}
