package arrayExercises;

import java.util.Scanner;

public class ChessKing {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int x1 = Integer.parseInt(input.nextLine());
        int y1 = Integer.parseInt(input.nextLine());
        int x2 = Integer.parseInt(input.nextLine());
        int y2 = Integer.parseInt(input.nextLine());

        boolean result = false;

        if((x1 + 1 == x2 && y1 == y2) ||
                (x1 - 1 == x2 && y1 == y2) ||
                (y1 + 1 == y2 && x1 == x2) ||
                (y1 - 1 == y2 && x1 == x2) ||
                (x1 + 1 == x2 && y1 + 1 == y2) ||
                (x1 + 1 == x2 && y1 - 1 == y2) ||
                (x1 - 1 == x2 && y1 + 1 == y2) ||
                (x1 - 1 == x2 && y1 - 1 == y2))
        {
            result = true;
        }

        System.out.println(result ? "YES" : "NO");
    }
}



//Condition

//Полето на шахматната дъска се определя от двойка числа (a, b), всяко от 1 до 8. Първото число определя номера на колоната,
//второто определя номера на реда. Дадени са две клетки от шахматната дъска. Определете дали Царя може да стигне, от първата
//клетка, до втората, с един ход.

//Входни данни
//Получавате 4 цели числа от 1 до 8 всяко, първите две определят началната клетка (с Царя), а вторите две определят крайната клетка.
//Началната и крайната клетки не съвпадат. Числата са написани на отделни редове.

//Изход
//Програмата трябва да изведе YES, ако е възможно да се стигне, от първата клетка, до втората клетка, с един ход на Царя,
//в противен случай изведете NO.



//Tests

//4
//4
//4
//3
//YES


//4
//4
//3
//4
//YES


//4
//4
//5
//4
//YES


//4
//4
//4
//5
//YES


//4
//4
//3
//5
//YES


//4
//4
//3
//3
//YES


//4
//4
//5
//3
//YES


//4
//4
//5
//5
//YES


//4
//4
//2
//2
//NO


//4
//4
//7
//4
//NO


//4
//4
//5
//6
//NO


//4
//4
//4
//8
//NO


//4
//4
//6
//7
//NO

