package oop.innerClassesPractice;

public class Main {
    public static void main(String[] args) {
        // Инстанция на вложен клас, в друг клас се създава по следният начин:

        CellPhone phone = new CellPhone("Motorola", "one action");
        phone.turnOn();
        Display display = phone.getDisplay();

        // Създаване на инстанция ако вътрешният клас е нестатичен
        Display.Pixel pixel = display.new Pixel(100, 100, Display.Colour.GREEN);

        // Създаване на инстанция ако вътрешният клас е статичен
        //Display.Pixel pixel = new Display.Pixel(100, 100, Display.Colour.GREEN);

        pixel.testScope(456);

        phone.call("877625388");
        phone.call("88127848o");
    }
}



// Вложен клас не може да съществува независимо от класа, в който е вложен. 
// Обхватът на вложен клас е ограничен до външния му клас. 
// Ако вложен клас е деклариран в обхвата на външен клас, той става член на последния. 
// Възможно е да декларираме вложен клас, който ще стане локален в рамките на блока.

// Има два типа вложени класове. Едните вложени класове се декларират с помощта на модификатора за достъп static, докато другите се декларират без него.
// Статичните вложени класове се обявяват с модификатора static. Те могат да се обръщат непосредствено към другите статични членове на външният клас, а
// към нестатичните членове могат да се обръщат само чрез препратка към обект.
// Нестатичните вложени класове се наричат вътрешни.
// Вътрешният клас има достъп до всички променливи и методи на външния клас, в който е вложен, и може да се обръща към тях непосредствено.
// Вътрешният клас се използва, за предоставяне на набор от услуги на външния клас, в който се съдържа.
