package basicSyntaxExercises;

import java.util.Scanner;

public class AlgorithmSplitter {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int a = Integer.parseInt(input.nextLine());
        int b = Integer.parseInt(input.nextLine());

        while(a > b) {
            if(a % 2 == 0 && a / 2 >= b) {
                a /= 2;
                System.out.println(":2");
            }
            else {
                --a;
                System.out.println("-1");
            }
        }
    }
}



//Условие

//Механизъмът Раздвоител преобразува естествени числа. Той има две команди: "Извади 1" и "Раздели на 2", първата команда намалява числото с 1,
//втората команда намалява числото наполовина, ако е четно, в противен случай възниква грешка.

//Входни данни
//Въвеждат се две естествени числа A и B (A>B).

//Изход
//Напишете алгоритъм за Раздвоителя, който преобразува числото A в число B и в същото време съдържа минималния брой инструкции.
//Командите от алгоритъма трябва да се извеждат по една на ред, като първата команда се обозначава като -1, а втората като :2.



//Тестове

//81
//9
//-1
//:2
//:2
//:2
//-1


//179
//20
//-1
//:2
//-1
//:2
//:2
//-1
//-1


//80
//53
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
//-1
