package basicSyntaxExercises;

import java.util.Scanner;

public class PageAndRow {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int k = input.nextInt();
        int n = input.nextInt();

        int page = n < k ? 1 : n % k == 0 ? n / k : n / k + 1;
        int row = n < k ? n : n % k == 0 ? k : n % k;

        System.out.printf("%d %d", page, row);
    }
}



//Условие

//Книгата съдържа по k реда на една страница. Така на 1-ва страница се отпечатват редовете от 1-и до k-ти, на втората страница - от
//ред (k + 1)-ви до (2k)-ти и т.н. Напишете програма, която по даден номер на ред в книгта, определя номера на страницата,
//на която е отпечатан този ред и поредният номер на този ред на страницата.

//Входни данни
//Дават се две числа: k - броят на редовете на една страница и n - номерът на реда в книгата (1 <= k <= 200, 1 <= n <= 20000).

//Изход
//Отпечатайте две числа разделени с интервал - номера на страницата, на която е отпечатан този ред, и поредният номер на реда на тази страница.



//30 1
//1 1

//30 29
//1 29

//30 30
//1 30

//36 71
//2 35

//36 72
//2 36

//36 73
//3 1

//36 114
//4 6

//36 756
//21 36
