package basicSyntaxExercises;

import java.util.Scanner;

public class PublicTransportDifficultVariant {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int planned = Integer.parseInt(input.nextLine());

        int oneTrip = 0, fiveTrip = 0, tenTrip = 0, twentyTrip = 0, sixtyTrip = 0;

        sixtyTrip += planned / 60;
        planned %= 60;

        if(planned >= 36) {
            sixtyTrip += 1;
            planned = 0;
        }

        if(planned >= 20) {
            twentyTrip += 1;
            planned %= 20;
        }

        if(planned >= 18) {
            twentyTrip += 1;
            planned = 0;
        }

        if(planned >= 10) {
            tenTrip += 1;
            planned %= 10;
        }

        if(planned == 9) {
            tenTrip += 1;
            planned = 0;
        }

        if(planned >= 5) {
            fiveTrip += 1;
            planned %= 5;
        }

        oneTrip += planned;

        System.out.printf("%d %d %d %d %d", oneTrip, fiveTrip, tenTrip, twentyTrip, sixtyTrip);
    }
}



//Условие

//В България през 90-те години на 20 век, парите губят покупателна стойност, заради хипер-инфлация. В софийският градски транспорт,
//билет за едно пътуване струва 15 лева, билет (талон) за 5 пътувания струва 70 лева, билет (талон) за 10 пътувания струва 125 лева,
//билет (талон) за 20 пътувания струва 230 лева, билет (талон) за 60 пътувания струва 440 лева. Един пътник планира да направи n пътувания.
//Определете колко билета от всеки тип трябва да закупи, така че общият брой платени пътувания да не е по-малък от n, а общата цена
//на закупените билети да е минимална.

//Входни данни
//Дадено е едно положително, цяло число n - броят на пътуванията.

//Изход
//Отпечатайте пет цели числа, равни на необходимия брой билети за 1, 5, 10, 20, 60 пътувания. Ако за дадени n пътувания, има няколко начина
//за закупуване на билети на една и съща цена, трябва да отпечатате комбинацията от билети, която дава НАЙ-ГОЛЯМ БРОЙ ПЪТУВАНИЯ.



//Тестове

//4
//4 0 0 0 0

//5
//0 1 0 0 0

//8
//3 1 0 0 0

//9
//0 0 1 0 0

//10
//0 0 1 0 0

//14
//4 0 1 0 0

//16
//1 1 1 0 0

//18
//0 0 0 1 0

//19
//0 0 0 1 0

//20
//0 0 0 1 0

//35
//0 1 1 1 0

//87
//2 1 0 1 1

//153
//3 0 1 1 2



//Бележки:
//36 билета = 20 + 10 + 5 + 6 - цена 440 лв. (колкото 1 по 60)
//18 билета = 10 + 50 + 3, струват 240 лв. (повече от 1 по 20), а 19 билета струват 255 лв.
//9 билета = 5 + 4 струват 130 лв. (повече от 1 по 10)
